1s/ERP/extensions/liko/Documents/Лико_ВыполненныеРаботы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Лико_ВыполненныеРаботы</Name>
		</Properties>
	</Document>
</MetaDataObject>

1s/ERP/extensions/liko/InformationRegisters/Лико_ЦеныГруппНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Лико_ЦеныГруппНоменклатуры</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Наценка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПотериНаРезке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СкладскиеРасходы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Код</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Площадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЦеноваяГруппа</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипЦен</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_ТипЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

1s/ERP/extensions/liko/Documents/Лико_ВыполненныеРаботы/Ext/ManagerModule.bsl
&Вместо("ТекстЗапросаТаблицаЛико_ЗатратыПоЗаказу")
Функция Лико_ТекстЗапросаТаблицаЛико_ЗатратыПоЗаказу(Запрос, ТекстыЗапроса, Регистры)
		
	ИмяРегистра = "Лико_ЗатратыПоЗаказу";
	
	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ВТПрокатыТрафарета.Период КАК Период,
	|	ВТПрокатыТрафарета.ЗаказКлиента КАК ЗаказКлиента,
	|	ВТПрокатыТрафарета.РабочийЦентр КАК РабочийЦентр,
	|	МАКСИМУМ(ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.ТрафаретныеЗасветки)) КАК СтатьяЗатрат,
	|	ВТПрокатыТрафарета.Затрата КАК Затрата,
	|	ЕСТЬNULL(ВТПрокатыТрафарета.НомерПроката, 1) КАК НомерПроката,
	|	ВТПрокатыТрафарета.Количество КАК Количество,
	|	ЕСТЬNULL(ЗаказКлиентаВидыРабот.НомерПроката, 100) КАК НомерПрокатаРаботы,
	|	ВТПрокатыТрафарета.Количество * ЕСТЬNULL(ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследних.Цена, Лико_ЦеныГруппНоменклатурыСрезПоследних1.Цена), 0) КАК СуммаПлан,
	|	ВТПрокатыТрафарета.Количество КАК КоличествоПлан,
	|	СУММА(0) КАК Сумма
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ.Период КАК Период,
	|		ВТ.ЗаказКлиента КАК ЗаказКлиента,
	|		ВТ.РабочийЦентр КАК РабочийЦентр,
	|		ВТ.Затрата КАК Затрата,
	|		ВТ.Количество КАК Количество,
	|		ЗаказКлиентаЦвета.НомерПроката КАК НомерПроката
	|	ИЗ
	|		(ВЫБРАТЬ
	|			МАКСИМУМ(&Период) КАК Период,
	|			Лико_ВыполненныеРаботыРаботы.Ссылка.ЗаказКлиента КАК ЗаказКлиента,
	|			Лико_ВыполненныеРаботыРаботы.Ссылка.РабочийЦентр КАК РабочийЦентр,
	|			Лико_ВыполненныеРаботыРаботы.Ссылка.ТипСетки КАК Затрата,
	|			СУММА(1) КАК Количество
	|		ИЗ
	|			Документ.Лико_ВыполненныеРаботы.Работы КАК Лико_ВыполненныеРаботыРаботы
	|				ЛЕВОЕ СОЕДИНЕНИЕ Документ.Лико_ОтчетФормногоУчастка.ЗасветкаStork КАК Лико_ОтчетФормногоУчасткаЗасветкаStork
	|				ПО Лико_ВыполненныеРаботыРаботы.Ссылка.ЗаказКлиента = Лико_ОтчетФормногоУчасткаЗасветкаStork.Заказ
	|				ЛЕВОЕ СОЕДИНЕНИЕ Документ.Лико_ОтчетФормногоУчастка.ТрафСетки КАК Лико_ОтчетФормногоУчасткаТрафСетки
	|				ПО Лико_ВыполненныеРаботыРаботы.Ссылка.ЗаказКлиента = Лико_ОтчетФормногоУчасткаТрафСетки.Заказ
	|		ГДЕ
	|			Лико_ВыполненныеРаботыРаботы.Ссылка = &Ссылка
	|			И Лико_ВыполненныеРаботыРаботы.Работа = ЗНАЧЕНИЕ(Справочник.Лико_Работы.Засветка)
	|			И Лико_ОтчетФормногоУчасткаЗасветкаStork.Ссылка ЕСТЬ NULL
	|			И Лико_ОтчетФормногоУчасткаТрафСетки.Ссылка ЕСТЬ NULL
	|		
	|		СГРУППИРОВАТЬ ПО
	|			Лико_ВыполненныеРаботыРаботы.Ссылка.ЗаказКлиента,
	|			Лико_ВыполненныеРаботыРаботы.Ссылка.РабочийЦентр,
	|			Лико_ВыполненныеРаботыРаботы.Ссылка.ТипСетки) КАК ВТ
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Цвета КАК ЗаказКлиентаЦвета
	|			ПО ВТ.ЗаказКлиента = ЗаказКлиентаЦвета.Ссылка
	|				И (ЗаказКлиентаЦвета.ВидПечати = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыПечати.Траф))
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВТ.Период,
	|		ВТ.ЗаказКлиента,
	|		ВТ.РабочийЦентр,
	|		ВТ.Количество,
	|		ЗаказКлиентаЦвета.НомерПроката,
	|		ВТ.Затрата) КАК ВТПрокатыТрафарета
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.ВидыРабот КАК ЗаказКлиентаВидыРабот
	|		ПО ВТПрокатыТрафарета.ЗаказКлиента = ЗаказКлиентаВидыРабот.Ссылка
	|			И ВТПрокатыТрафарета.НомерПроката = ЗаказКлиентаВидыРабот.НомерПроката
	|			И ВТПрокатыТрафарета.РабочийЦентр.ВидРабочегоЦентра = ЗаказКлиентаВидыРабот.РабочийЦентр.ВидРабочегоЦентра
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ЦеныГруппНоменклатуры.СрезПоследних(, ТипЦен = ЗНАЧЕНИЕ(Перечисление.Лико_ТипЦен.Табаш)) КАК Лико_ЦеныГруппНоменклатурыСрезПоследних
	|		ПО ВТПрокатыТрафарета.Затрата = Лико_ЦеныГруппНоменклатурыСрезПоследних.ЦеноваяГруппа
	|			И ВТПрокатыТрафарета.ЗаказКлиента.Площадка = Лико_ЦеныГруппНоменклатурыСрезПоследних.Площадка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ЦеныГруппНоменклатуры.СрезПоследних(
	|				,
	|				ТипЦен = ЗНАЧЕНИЕ(Перечисление.Лико_ТипЦен.Табаш)
	|					И Площадка.Наименование = "" Ликофлекс"") КАК Лико_ЦеныГруппНоменклатурыСрезПоследних1
	|		ПО ВТПрокатыТрафарета.Затрата = Лико_ЦеныГруппНоменклатурыСрезПоследних1.ЦеноваяГруппа
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТПрокатыТрафарета.Период,
	|	ВТПрокатыТрафарета.ЗаказКлиента,
	|	ВТПрокатыТрафарета.РабочийЦентр,
	|	ВТПрокатыТрафарета.Количество,
	|	ВТПрокатыТрафарета.Затрата,
	|	ЕСТЬNULL(ВТПрокатыТрафарета.НомерПроката, 1),
	|	ЕСТЬNULL(ЗаказКлиентаВидыРабот.НомерПроката, 100),
	|	ВТПрокатыТрафарета.Количество * ЕСТЬNULL(ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследних.Цена, Лико_ЦеныГруппНоменклатурыСрезПоследних1.Цена), 0),
	|	ВТПрокатыТрафарета.Количество
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерПрокатаРаботы" ;


	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции


&Вместо("ЗарегистрироватьУчетныеМеханизмы")
Процедура Лико_ЗарегистрироватьУчетныеМеханизмы(МеханизмыДокумента)
	МеханизмыДокумента.Добавить("Лико_Склад");
КонецПроцедуры


&Вместо("ЗаполнитьПараметрыИнициализации")
Процедура Лико_ЗаполнитьПараметрыИнициализации(Запрос, ДокументОбъект) 
	
	ДокументСсылка = ДокументОбъект.Ссылка;

	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ВыполненныеРаботы.Дата КАК Период,
	|	Лико_ВыполненныеРаботы.Номер КАК Номер,
	|	Лико_ВыполненныеРаботы.Организация КАК Организация,
	|	Лико_ВыполненныеРаботы.ЗаказКлиента КАК ЗаказКлиента
	|ИЗ
	|	Документ.Лико_ВыполненныеРаботы КАК Лико_ВыполненныеРаботы
	|ГДЕ
	|	Лико_ВыполненныеРаботы.Ссылка = &Ссылка";
	Реквизиты = Запрос.Выполнить().Выбрать();
	Реквизиты.Следующий();


	Запрос.УстановитьПараметр("Период",      				Реквизиты.Период);
	Запрос.УстановитьПараметр("ЗаказКлиента", 				Реквизиты.ЗаказКлиента);
	Запрос.УстановитьПараметр("Организация",    			Реквизиты.Организация);
	Запрос.УстановитьПараметр("Ссылка",    					ДокументСсылка);





КонецПроцедуры
